PASSWORD_REGEXP = r"(?m)^(?=.*?[0-9])(?=.*?[a-z])(?=.*?[A-Z])(?=.*?([!@#$%^&*?]).*?(?!\1)[!@#$%^&*?])(?:([" \
                  r"a-zA-Z0-9!@#$%^&*?])(?!\2)){8,}$"

IPV6_full_REGEXP = r"(?:\x5BIPv6:(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)"
IPV6_comp = r"(?:(?=\x5BIPv6(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)"
IPV6V4_full = r"(?:\x5BIPv6[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)"
IPV6V4_comp = r"(?:(?=\x5BIPv6(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)"


IPV6 = r"(?:" + IPV6_full_REGEXP + r"|" + IPV6_comp + r"|" + IPV6V4_full + r"|" + IPV6V4_comp + r")"  # поиск IPV6

DOMAIN_EXPR_OLD = r"(?:(?=.*\w.*(?:\x20|$]))[\x41-\x5A\x61-\x7A0-9](?:[\x41-\x5A\x61-\x7A0-9-]*[\x41-\x5A\x61-\x7A0-9]){0," \
                  r"1}(?:\.[\x41-\x5A\x61-\x7A0-9](?:[\x41-\x5A\x61-\x7A0-9-]*[\x41-\x5A\x61-\x7A0-9]){0,1})*)"  # здесь может начинаться# с цифры

DOMAIN_EXPR_COOLEST = r"(?:(?=[0-9\.-]*[a-zA-Z])[\x41-\x5A\x61-\x7A0-9](?:[\x41-\x5A\x61-\x7A0-9-]*[\x41-\x5A\x61-\x7A0-9]){0," \
                      r"1}(?:\.[\x41-\x5A\x61-\x7A0-9](?:[\x41-\x5A\x61-\x7A0-9-]*[\x41-\x5A\x61-\x7A0-9]){0,1})*)"

DOMAIN_EXPR = r"(?:[\x41-\x5A\x61-\x7A](?:[\x41-\x5A\x61-\x7A0-9-]*[\x41-\x5A\x61-\x7A0-9]){0,1}(?:\.[" \
              r"\x41-\x5A\x61-\x7A](?:[\x41-\x5A\x61-\x7A0-9-]*[\x41-\x5A\x61-\x7A0-9]){0,1})*)"  # здесь начинается только с буквы

LOCAL_PART_DQUOTE_EXPR_QCONTENT_OLD = r"(?:\"(?:(?:(?:[\x20\t]*\r\n){0," \
                                      r"1}[\x20\t]+){0,1}(?:[\x21\x23-\x5B\x5D-\x7E]|\x5C[\x21-\x7E]))*(?:(?:\x20*[\x20\t]){0,1}\x20+){0," \
                                      r"1}\")"

LOCAL_PART_DQUOTE_EXPR_QCONTENT = r'(?:\"(?:(?:(?:[ \x21\x23-\x5B\x5D-\x7E]|\x5C[\x20-\x7E])))*\")'

LOCAL_PART_DQUOTE_EXPR_QPAIR = r'(?:\x22\x5C[\x20-\x7E]\x22)'

COMMENTS1 = r"(?:\((?:[\x20\x21-\x27\x2A-\x5B\x5D-\x7E]|(?:\x5C[\x20-\x7E])|(?:\((?:[" \
           r"\x20\x21-\x27\x2A-\x5B\x5D-\x7E]|(?:\x5C[\x21-\x7E]))*\)))*\)){0,1}"

COMMENTS = r""

GENERAL_ADDR_LIT_EXPR = r'(?:\x5B(?:[a-zA-Z0-9-]*[a-zA-Z0-9]):[\x21-\x5A\x5E-\x7E]+\x5D)'

EMAIL_REGEXP = r"(?m)(?:(?<=\x20)|(?<=^))" + r"" + COMMENTS + r"(?:(?:[\x41-\x5A\x61-\x7A0-9\x21\x23-\x27*+\-\/=?^_`{\x7C}~]+(?:\.[" \
                                                              r"\x41-\x5A\x61-\x7A0-9\x21\x23-\x27*+\-\/=?^_`{\x7C}~]+)*)|" + LOCAL_PART_DQUOTE_EXPR_QCONTENT + r")" \
               + COMMENTS + \
               r"@" + COMMENTS + r"(?:" + DOMAIN_EXPR_COOLEST + r"|(?:\x5B(?:(?:25[0-5]|2[0-4][0-9]|[01]?[" \
                                                                r"0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|" + IPV6 + r"|" + GENERAL_ADDR_LIT_EXPR + r")" \
               + COMMENTS + r"(?=(?:\x20|$))"

HTTP_HTTPS_REGEXP = r"(?:https?://(?:(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]){2}|[!$&'()*+,;=]|:)*@){0,1}(?:(?:(?:\x5B(" \
                    r"?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2," \
                    r"6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{" \
                    r"1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(" \
                    r"?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(" \
                    r"?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0,4}:){2," \
                    r"4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1," \
                    r"4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[" \
                    r"0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+," \
                    r";=]|:)+\])|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[" \
                    r"0-9][0-9]?))|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[" \
                    r"a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*))(?::[0-9]*){0,1}(?:\/(?:[a-zA-Z0-9-._~]|(" \
                    r"?:%[a-fA-F0-9]{2})|[!$&'()*+,;=]|:|@)*)*)(?:(?:\?(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
                    r"!$&'()*+,;=]|:|@)|\/|\?)*){0,1}(?:#(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+," \
                    r";=]|:|@)|\/|\?)*){0,1}))"

FTP_REGEXP = r"(?:ftp://(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])+(?::(?:[a-zA-Z0-9-._~]|(?:%[" \
             r"a-fA-F0-9]{2})|[!$&'()*+,;=])*){0,1}@){0,1}(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1," \
             r"4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1," \
             r"4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[" \
             r"0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
             r"0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1," \
             r"4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0," \
             r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
             r"0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[" \
             r"!$&'()*+,;=]|:)+\])|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[" \
             r"0-9][0-9]?))|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[a-zA-Z0-9-._~]|(?:%[" \
             r"a-fA-F0-9]{2})|[!$&'()*+,;=])*))(?::[0-9]*){0,1}(?:(?:(?:\/(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
             r"!$&'()*+,=]|:|@)*)*){0,1}(?:\/(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,=]|:|@)*)(?:;type=[" \
             r"a-zA-Z]){0,1}){0,1})"

SFTP_REGEXP = r"(?:sftp:\/\/(?:(?:(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=]|:)*){0," \
              r"1}(?:;[a-zA-Z0-9-]*=[a-zA-Z0-9-]*(?:,[a-zA-Z0-9-]*=[a-zA-Z0-9-]*)*){0,1}@){0,1}(?:(?:(?:\x5B(?:(?:[" \
              r"0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0," \
              r"4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1," \
              r"4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[" \
              r"0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1," \
              r"4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[" \
              r"0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][" \
              r"a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
              r"!$&'()*+,;=])*[a-zA-Z](?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*))(?::[0-9]*){0," \
              r"1}(?:\/(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=]|:|@)*)*)(?:;[a-zA-Z0-9-]*=[a-zA-Z0-9-]*(" \
              r"?:,[a-zA-Z0-9-]*=[a-zA-Z0-9-]*)*){0,1})"

SSH_REGEXP = r"(?:ssh:\/\/(?:(?:(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=]|:)*){0,1}(?:;[a-zA-Z0-9-]*=[" \
             r"a-zA-Z0-9-]*(?:,[a-zA-Z0-9-]*=[a-zA-Z0-9-]*)*){0,1}@){0,1}(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7," \
             r"7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{" \
             r"1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0," \
             r"1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
             r"0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0," \
             r"4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{" \
             r"1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[" \
             r"0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[" \
             r"a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
             r"0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[" \
             r"a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*))(?::[0-9]*){0,1}(?:\/(?:[a-zA-Z0-9-._~]|(?:%[" \
             r"a-fA-F0-9]{2})|[!$&'()*+,;=]|:|@)*)*))"

SMB_ABS_URI = r"(?:(?:smb|cifs):\/\/(?:(?:(?:(?:(?:(?:(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1," \
              r"4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[" \
              r"0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[" \
              r"0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{" \
              r"1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0," \
              r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[" \
              r"a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*)|(?:(" \
              r"?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)))|(?:[" \
              r"a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2}))(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1," \
              r"14}(?:\.)(?:\.(?:(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'(" \
              r")*+,;=]|(?:%[0-9a-fA-F]{2})){1,63})*){0,1}){0,1});){0,1})(?:(?:[a-zA-Z0-9-._~!$&'()*+," \
              r"=:]|(?:%[a-fA-F0-9]{2}))*)@){0,1}(?:(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1," \
              r"4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[" \
              r"0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[" \
              r"0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{" \
              r"1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0," \
              r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[" \
              r"a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
              r"0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*))|(?:(?:(?:[" \
              r"0-9a-zA-Z-_~!$&'()+,;=]|(?:%[a-fA-F0-9]{2}))(?:[0-9a-zA-Z-_~!$&'()+,;=*]|(?:%[a-fA-F0-9]{2})){1," \
              r"14})(?:\.(?:(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+," \
              r";=]|(?:%[0-9a-fA-F]{2})){1,63})*){0,1}){0,1})){0,1}(?::[0-9]*){0,1}(?:\/){0,1})|(?:(?:(?:(?:(?:(?:(" \
              r"?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2," \
              r"6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[" \
              r"0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(" \
              r"?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[" \
              r"0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0," \
              r"1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(" \
              r"?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{" \
              r"2})|[!$&'()*+,;=])*)|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[" \
              r"01]?[0-9][0-9]?)))|(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2}))(?:[a-zA-Z0-9-_~!$&'()+," \
              r";=]|(?:%[0-9a-fA-F]{2})|\*){1,14}(?:\.)(?:\.(?:(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1," \
              r"63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63})*){0,1}){0,1});){0,1})(?:(?:[" \
              r"a-zA-Z0-9-._~!$&'()*+,=:]|(?:%[a-fA-F0-9]{2}))*)@){0,1}(?:(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7," \
              r"7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{" \
              r"1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0," \
              r"1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0," \
              r"4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0,4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{" \
              r"1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[" \
              r"01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[" \
              r"a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
              r"0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*))|(?:(?:(?:[" \
              r"0-9a-zA-Z-_~!$&'()+,;=]|(?:%[a-fA-F0-9]{2}))(?:[0-9a-zA-Z-_~!$&'()+,;=*]|(?:%[a-fA-F0-9]{2})){1," \
              r"14})(?:\.(?:(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+," \
              r";=]|(?:%[0-9a-fA-F]{2})){1,63})*){0,1}){0,1})){0,1}(?:\/(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
              r"!$&'()*+,;=:@])+(?:\/(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=:@])*)*){0,1}){0,1})(?:\?(?:(" \
              r"?:(?:BROADCAST=(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)(?::[0-9]*){0,1})|(?:CALLED=(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2}))(?:[" \
              r"a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1,14})|(?:CALLING=(?:[a-zA-Z0-9-_~!$&'()+," \
              r";=]|(?:%[0-9a-fA-F]{2}))(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1," \
              r"14})|(?:(?:NBNS=|WINS=)(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(" \
              r"?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0," \
              r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{" \
              r"1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0," \
              r"4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
              r"0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(" \
              r"?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[" \
              r"a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
              r"!$&'()*+,;=])*))(?::[0-9]*){0,1})|(?:NODETYPE=[BPMH])|(?:(?:SCOPEID=|SCOPE=)(?:(?:[a-zA-Z0-9-_~!$&'(" \
              r")*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63})*){0," \
              r"1}))(?:;(?:(?:BROADCAST=(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[" \
              r"01]?[0-9][0-9]?)(?::[0-9]*){0,1})|(?:CALLED=(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2}))(?:[" \
              r"a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1,14})|(?:CALLING=(?:[a-zA-Z0-9-_~!$&'()+," \
              r";=]|(?:%[0-9a-fA-F]{2}))(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1," \
              r"14})|(?:(?:NBNS=|WINS=)(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(" \
              r"?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0," \
              r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{" \
              r"1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0," \
              r"4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
              r"0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(" \
              r"?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[" \
              r"a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
              r"!$&'()*+,;=])*))(?::[0-9]*){0,1})|(?:NODETYPE=[BPMH])|(?:(?:SCOPEID=|SCOPE=)(?:(?:[a-zA-Z0-9-_~!$&'(" \
              r")*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63})*){0," \
              r"1})))*){0,1}){0,1})"

SMB_REL_URI = r"(?:(?:(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=:@])+(?:\/(?:[a-zA-Z0-9-._~]|(?:%[" \
              r"a-fA-F0-9]{2})|[!$&'()*+,;=:@])*)*)|(?:\/(?:(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+," \
              r";=:@])+(?:\/(?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=:@])*)*){0,1}))(?:\?(?:(?:(" \
              r"?:BROADCAST=(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)(?::[0-9]*){0,1})|(?:CALLED=(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2}))(?:[" \
              r"a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1,14})|(?:CALLING=(?:[a-zA-Z0-9-_~!$&'()+," \
              r";=]|(?:%[0-9a-fA-F]{2}))(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1," \
              r"14})|(?:(?:NBNS=|WINS=)(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(" \
              r"?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0," \
              r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{" \
              r"1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0," \
              r"4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
              r"0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(" \
              r"?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[" \
              r"a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
              r"!$&'()*+,;=])*))(?::[0-9]*){0,1})|(?:NODETYPE=[BPMH])|(?:(?:SCOPEID=|SCOPE=)(?:(?:[a-zA-Z0-9-_~!$&'(" \
              r")*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63})*){0," \
              r"1}))(?:;(?:(?:BROADCAST=(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[" \
              r"01]?[0-9][0-9]?)(?::[0-9]*){0,1})|(?:CALLED=(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2}))(?:[" \
              r"a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1,14})|(?:CALLING=(?:[a-zA-Z0-9-_~!$&'()+," \
              r";=]|(?:%[0-9a-fA-F]{2}))(?:[a-zA-Z0-9-_~!$&'()+,;=]|(?:%[0-9a-fA-F]{2})|\*){1," \
              r"14})|(?:(?:NBNS=|WINS=)(?:(?:(?:\x5B(?:(?:[0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4})\x5D)|(?:(?=\x5B(" \
              r"?:[0-9a-fA-F]{0,4}:){2,6}[0-9a-fA-F]{0,4}\x5D)\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0," \
              r"1}::(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,5}){0,1}\x5D)|(?:\x5B[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{" \
              r"1,4}){5}:(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][" \
              r"0-9]?)\x5D)|(?:(?=\x5B(?:(?:::(?:[0-9a-fA-F]{1,4}:){0,4})|(?:[0-9a-fA-F]{1,4}:(?:[0-9a-fA-F]{0," \
              r"4}:){2,4}[^:]+\x5D)))\x5B(?:[0-9a-fA-F]{1,4}(?::[0-9a-fA-F]{1,4}){0,3}){0,1}::(?:[0-9a-fA-F]{1," \
              r"4}(?::[0-9a-fA-F]{1,4}){0,3}:){0,1}(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[" \
              r"0-4][0-9]|[01]?[0-9][0-9]?)\x5D))|(?:\[[vV][a-zA-Z0-9]+\.(?:[a-zA-Z0-9-._~]|[!$&'()*+,;=]|:)+\])|(?:(" \
              r"?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?))|(?:(?:[" \
              r"a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[!$&'()*+,;=])*[a-zA-Z](?:[a-zA-Z0-9-._~]|(?:%[a-fA-F0-9]{2})|[" \
              r"!$&'()*+,;=])*))(?::[0-9]*){0,1})|(?:NODETYPE=[BPMH])|(?:(?:SCOPEID=|SCOPE=)(?:(?:[a-zA-Z0-9-_~!$&'(" \
              r")*+,;=]|(?:%[0-9a-fA-F]{2})){1,63}(?:\.(?:[a-zA-Z0-9-_~!$&'()*+,;=]|(?:%[0-9a-fA-F]{2})){1,63})*){0," \
              r"1})))*){0,1}){0,1})"

SMB_URI = r"(?:" + SMB_ABS_URI + r")"

URI_REGEXP = r"(?m)(?:(?<=\x20)|(?<=^))" + r"(?:" + HTTP_HTTPS_REGEXP + r"|" + FTP_REGEXP + r"|" + SFTP_REGEXP + r"|" + \
             SSH_REGEXP + r"|" + SMB_URI + r")" + r"(?=(?:\x20|$))"

DATE_DDMMYY_WITH_UTOCHN = r"(?:(?:(?:(?:(?:(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)(?:[ \n]утром|[ " \
                          r"\n]вечером|[ \n]дн[её]м)?)|(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)[ \n])?(" \
                          r"?:утром|вечером|дн[её]м|ночью)))|(?:(?:(?:(?:во?|после|на|до|с|со|по|в течение|к|об?|за)(?:(?: " \
                          r"начал| конц)[ауе]| середин[еауы]| конец| начало)?[ \n])(?:[^ \n]+[ \n])?(?:год[" \
                          r"уа]?|месяц[еа]?|век[еу]?|тысячелети[июе]|полугоди[еюи]|квартал[еу]?|половин[" \
                          r"еау]?|понедельник[уа]?|вторник[уа]?|сред[уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[" \
                          r"аыеу]|воскресень[еяю]|числа|утр(?:ом?а)|вечер(?:а|ом)?|(?:день|дня|дн[её]м)|недел[" \
                          r"еяи]|день|дни|днях|январ[ьея]|феврал[ьея]|март[ае]?|апрел[ьея]|ма[йея]|июн[ьея]|июл[" \
                          r"ьея]|август[еа]?|сентябр[ьея]|октябр[ьея]|ноябр[ьея]|декабр[" \
                          r"ьея]|зимой|летом|весной|осенью|лето|зима|осень|весна|(?:утром|вечером|дн[" \
                          r"её]м|ночью)|выходны[ех]))))|(?:во?|после|на|до|с|со|по|в течение|к|об?|за)[ \n](?:понедельник[" \
                          r"уа]?|вторник[уа]?|сред[уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю]))(?:[ " \
                          r"\n]?,?[ \n]?)(?:(?:(?:[1-2][0-9]|0[1-9])[.\/-](?:0[1-9]|1[0-2])(?:[.\/-]\d\d\d\d)?|(?:30[" \
                          r".\/-](?:0[13-9]|1[0-2])|31[.\/-](?:0[13578]|1[02]))(?:[.\/-]\d\d\d\d)?)|(?:(?:0[1-9]|1[" \
                          r"0-2])[.\/-](?:[1-2][0-9]|0[1-9])(?:[.\/-]\d\d\d\d)?)|(?:(?:0[13-9]|1[0-2])[.\/-]30|(?:0[" \
                          r"13578]|1[02])-31)(?:[.\/-]\d\d\d\d)?))|(?:(?:(?:(?:(?:во?|после|на|до|с|со|по|в " \
                          r"течение|к|об?|за)[ \n])?(?:(?:(?:[1-2][0-9]|0[1-9])[.\/-](?:0[1-9]|1[0-2])(?:[" \
                          r".\/-]\d\d\d\d)?|(?:30[.\/-](?:0[13-9]|1[0-2])|31[.\/-](?:0[13578]|1[02]))(?:[" \
                          r".\/-]\d\d\d\d)?)|(?:(?:0[1-9]|1[0-2])[.\/-](?:[1-2][0-9]|0[1-9])(?:[.\/-]\d\d\d\d)?)|(?:(" \
                          r"?:0[13-9]|1[0-2])[.\/-]30|(?:0[13578]|1[02])-31)(?:[.\/-]\d\d\d\d)?)))(?: ?,? ?)(?:(?:(" \
                          r"?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)(?:[ \n]утром|[ \n]вечером|[ \n]дн[" \
                          r"её]м)?)|(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)[ \n])?(?:утром|вечером|дн[" \
                          r"её]м|ночью)))|(?:(?:(?:(?:во?|после|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| " \
                          r"середин[еауы]| конец| начало)?[ \n])(?:[^ \n]+[ \n])?(?:год[уа]?|месяц[еа]?|век[" \
                          r"еу]?|тысячелети[июе]|полугоди[еюи]|квартал[еу]?|половин[еау]?|понедельник[уа]?|вторник[" \
                          r"уа]?|сред[уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю]|числа|утр(" \
                          r"?:ом?а)|вечер(?:а|ом)?|(?:день|дня|дн[её]м)|недел[еяи]|день|дни|днях|январ[ьея]|феврал[" \
                          r"ьея]|март[ае]?|апрел[ьея]|ма[йея]|июн[ьея]|июл[ьея]|август[еа]?|сентябр[ьея]|октябр[" \
                          r"ьея]|ноябр[ьея]|декабр[ьея]|зимой|летом|весной|осенью|лето|зима|осень|весна|(" \
                          r"?:утром|вечером|дн[её]м|ночью)|выходны[ех]))))|(?:во?|после|на|до|с|со|по|в течение|к|об?|за)[ " \
                          r"\n](?:понедельник[уа]?|вторник[уа]?|сред[уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[" \
                          r"аыеу]|воскресень[еяю])))))"

DATE_S_PO = r"(?:(?:(?:(?:с[ \n](?:[^ \n]+[ \n]){1,2}(?:по|на|до)[ \n][^ \n]+[ \n])|(?:(?:за|в|по|на|до)[ \n])?[^ " \
            r"\n]+[ \n]?(?:-|–)[ \n]?[^ \n]+[ \n])(?:годах|год[ыа]?|век(?:а|ов)?|вв\.|гг\.|числа|дни|недели|месяц[" \
            r"ыа]|января|февраля|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря))(?:(?:(?:[ \n][^ " \
            r"\n]+[ \n])(?:год[ыа]|века|вв\.|гг\.|числа|дни|недели|месяц[" \
            r"ыа]|января|февраля|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря))| ежедневно)?)"

DATE_DATE_TEXT = r"(?:(?:(?:во?|после|на|до|с|со|по|в течение|к|от|об?|за)(?:(?: начал| конц)[ауе]| середин[еауы]| конец| " \
                 r"начало)?[ \n]))?(?:(?:(?:(?:(?:(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят|десят)(" \
                 r"?:ой|ый|ого|ое|ому|ым|ом))|(?:трет(?:ье(?:му|го|м)?|ий|им)))|(?:(" \
                 r"?:одиннадцат|двенадцат|тринадцат|четырнадцат|пятнадцат|шестнадцат|семнадцат|восемнадцат|девятнадцат)(?:и|ь|ью|ого|ому|ый|ым|ом))|[1-2][0-9]|[1-9]|двадцатого|(?:двадцать )(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят)(?:ой|ый|ого|ое|ому|ым|ом))|(?:трет(?:ье(?:му|го|м)?|ий|им)))))(?:[ \n]?(?:(?:январ|феврал|апрел|июн|июл|сентябр|октябр|ноябр|декабр)(?:[ьяею]|[её]м)|(?:март|август)(?:[уеа]|ом)?|ма(?:[яею]|ем)|числ(?:[оау]|ом))))|(?:(?:тридцатого|30)(?:[ \n](?:января|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря|числа)))|(?:(?:тридцать[ \n]первого|31)(?:[ \n](?:января|марта|мая|июля|августа|октября|декабря|числа))))|(?:(?:(?:во?|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| середин[еауы]| конец| начало)?[ \n])(?:[ \n]?(?:(?:январ|феврал|апрел|июн|июл|сентябр|октябр|ноябр|декабр)(?:[ьяею]|[её]м)|(?:март|август)(?:[уеа]|ом)?|ма(?:[яею]|ем)|числ(?:[оау]|ом)))))(?:(?:\x20(?:\d+|прошлого|э?того|следующего|двухтысячного|тысячного|тр[её]хтысячного|(?:две|три|четыре|пять|шесть|семь) тысячи?))?(?:[ \n](?:ст[оа]|двести|двухсот(?:ого)?|триста|тр[её]хсот(?:ого)?|четыреста|четыр[её]хсот(?:ого)?|пят[ьи]сот(?:ого)?|шест[ьи]сот(?:ого)?|сем[ьи]сот(?:ого)?|восемьсот|восьмисот(?:ого)?|девят[ьи]сот(?:ого)?))?(?:[ \n](?:двадцат(?:[ьи]|ого)|тридцат(?:[ьи]|ого)|сорок(?:а|ового)?|пятьдесят|пятидесяти(?:ого)?|шестьдесят|шестидесяти(?:ого)?|семьдесят|семидесяти(?:ого)?|восемьдесят|восьмидесяти(?:ого)?|девяност(?:ого|[оа])))?(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят)(?:ого))|(?:трет(?:ьего))))?(?:[ \n]года|[ \n]г\.)(?:[ \n]до[ \n]нашей[ \n]эры|[ \n]до[ \n]н\.[ \n]?э\.)?)?)|(?:\d+(?:[ \n]год[уа]?|[ \n]г\.)(?:[ \n]до[ \n]нашей[ \n]эры|[ \n]до[ \n]н\.[ \n]?э\.)?))"

DATE_CHEREZ_NAZAD = r"(?:(?:(?:через|по[ \n]истечению|спустя)(?:[ \n]\d+)?(?:[ \n](?:дней|дня|день|недел[" \
                    r"ьию]?|месяцев|месяца?|лет|года?)))|(?:(?:\d+[ \n])?(?:(?:дней|дня|день|недел[" \
                    r"ьию]?|месяцев|месяца?|лет|года?)[ \n])(?:назад|спустя)))"   # исправлено

DATE_PRIL_PLUS_SUSH = r"(?:(?:(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)(?:[ \n]утром|[ \n]вечером|[ \n]дн[" \
                      r"её]м)?)|(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)[ \n])?(?:утром|вечером|дн[" \
                      r"её]м|ночью)))|(?:(?:(?:(?:во?|после|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| " \
                      r"середин[еауы]| конец| начало)?[ \n])(?:[^ \n]+[ \n])(?:год[уа]?|месяц[еа]?|век[" \
                      r"еу]?|тысячелети[июе]|полугоди[еюи]|квартал[еу]?|половин[еау]?|понедельник[уа]?|вторник[" \
                      r"уа]?|сред[уаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю]|числа|утр(" \
                      r"?:ом?а)|вечер(?:а|ом)?|(?:день|дня|дн[её]м)|недел[еяи]|день|дни|днях|январ[ьея]|феврал[" \
                      r"ьея]|март[ае]?|апрел[ьея]|ма[йея]|июн[ьея]|июл[ьея]|август[еа]?|сентябр[ьея]|октябр[" \
                      r"ьея]|ноябр[ьея]|декабр[ьея]|зимой|летом|весной|осенью|лето|зима|осень|весна|(" \
                      r"?:утром|вечером|дн[её]м|ночью)|выходны[ех]))))(?:[ \n](?:[^ \n]+[ \n])?(?:год[уаы]?|месяц[" \
                      r"еаы]?|век[еуа]?|тысячелети[июе]|полугоди[еюи]|квартал[еу]?|половин[еау]?|понедельник[" \
                      r"уа]?|вторник[уа]?|сред[уаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[" \
                      r"еяю]|числа|утр(?:ом?а)|вечер(?:а|ом)?|(?:день|дня|дн[её]м)|недел[еяи]|день|дни|днях|январ[" \
                      r"ьея]|феврал[ьея]|март[ае]?|апрел[ьея]|ма[йея]|июн[ьея]|июл[ьея]|август[еа]?|сентябр[" \
                      r"ьея]|октябр[ьея]|ноябр[ьея]|декабр[ьея]|зимой|летом|весной|осенью|лето|зима|осень|весна|(" \
                      r"?:утром|вечером|дн[её]м)|выходны[ех]))?)|(?:во?|после|на|до|с|со|по|в течение|к|об?|за)[ \n](" \
                      r"?:понедельник[уа]?|вторник[уа]?|сред[уаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[" \
                      r"еяю])"

DATE_DDMMYY_S_PREDLOG = r"(?:(?:(?:во?|после|на|до|с|со|по|в течение|к|об?|за)[ \n])?(?:(?:(?:[1-2][0-9]|0[1-9])[.\/-](?:0[" \
                        r"1-9]|1[0-2])(?:[.\/-]\d\d\d\d)?|(?:30[.\/-](?:0[13-9]|1[0-2])|31[.\/-](?:0[13578]|1[02]))(" \
                        r"?:[.\/-]\d\d\d\d)?)|(?:(?:0[1-9]|1[0-2])[.\/-](?:[1-2][0-9]|0[1-9])(?:[.\/-]\d\d\d\d)?)|(" \
                        r"?:(?:0[13-9]|1[0-2])[.\/-]30|(?:0[13578]|1[02])-31)(?:[.\/-]\d\d\d\d)?))"

DATE_PLUS_TEXT = r"(?:(?:(?:(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)(?:[ \n]утром|[ \n]вечером|[ \n]дн[" \
                 r"её]м)?)|(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)[ \n])?(?:утром|вечером|дн[" \
                 r"её]м|ночью)))|(?:(?:(?:(?:во?|после|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| середин[" \
                 r"еауы]| конец| начало)?[ \n])(?:[^ \n]+[ \n])?(?:год[уа]?|месяц[еа]?|век[еу]?|тысячелети[" \
                 r"июе]|полугоди[еюи]|квартал[еу]?|половин[еау]?|понедельник[уа]?|вторник[уа]?|сред[уеаы]|четверг[" \
                 r"уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю]|числа|утр(?:ом?а)|вечер(?:а|ом)?|(?:день|дня|дн[" \
                 r"её]м)|недел[еяи]|день|дни|днях|январ[ьея]|феврал[ьея]|март[ае]?|апрел[ьея]|ма[йея]|июн[ьея]|июл[" \
                 r"ьея]|август[еа]?|сентябр[ьея]|октябр[ьея]|ноябр[ьея]|декабр[" \
                 r"ьея]|зимой|летом|весной|осенью|лето|зима|осень|весна|(?:утром|вечером|дн[её]м|ночью)|выходны[" \
                 r"ех]))))|(?:во?|после|на|до|с|со|по|в течение|к|об?|за)[ \n](?:понедельник[уа]?|вторник[уа]?|сред[" \
                 r"уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю]))[ \n]?,?[ \n]?(?:(?:(?:(?:(?:(?:(?:(" \
                 r"?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят|десят)(?:ой|ый|ого|ое|ому|ым|ом))|(?:трет(" \
                 r"?:ье(?:му|го|м)?|ий|им)))|(?:(" \
                 r"?:одиннадцат|двенадцат|тринадцат|четырнадцат|пятнадцат|шестнадцат|семнадцат|восемнадцат|девятнадцат)(?:и|ь|ью|ого|ому|ый|ым|ом))|[1-2][0-9]|[1-9]|двадцатого|(?:двадцать )(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят)(?:ой|ый|ого|ое|ому|ым|ом))|(?:трет(?:ье(?:му|го|м)?|ий|им)))))(?:[ \n]?(?:(?:январ|феврал|апрел|июн|июл|сентябр|октябр|ноябр|декабр)(?:[ьяею]|[её]м)|(?:март|август)(?:[уеа]|ом)?|ма(?:[яею]|ем)|числ(?:[оау]|ом))))|(?:(?:тридцатого|30)(?:[ \n](?:января|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря|числа)))|(?:(?:тридцать[ \n]первого|31)(?:[ \n](?:января|марта|мая|июля|августа|октября|декабря|числа))))|(?:(?:(?:во?|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| середин[еауы]| конец| начало)?[ \n])(?:[ \n]?(?:(?:январ|феврал|апрел|июн|июл|сентябр|октябр|ноябр|декабр)(?:[ьяею]|[её]м)|(?:март|август)(?:[уеа]|ом)?|ма(?:[яею]|ем)|числ(?:[оау]|ом)))))(?:(?:\x20(?:\d+|прошлого|э?того|следующего|двухтысячного|тысячного|тр[её]хтысячного|(?:две|три|четыре|пять|шесть|семь) тысячи?))?(?:[ \n](?:ст[оа]|двести|двухсот(?:ого)?|триста|тр[её]хсот(?:ого)?|четыреста|четыр[её]хсот(?:ого)?|пят[ьи]сот(?:ого)?|шест[ьи]сот(?:ого)?|сем[ьи]сот(?:ого)?|восемьсот|восьмисот(?:ого)?|девят[ьи]сот(?:ого)?))?(?:[ \n](?:двадцат(?:[ьи]|ого)|тридцат(?:[ьи]|ого)|сорок(?:а|ового)?|пятьдесят|пятидесяти(?:ого)?|шестьдесят|шестидесяти(?:ого)?|семьдесят|семидесяти(?:ого)?|восемьдесят|восьмидесяти(?:ого)?|девяност(?:ого|[оа])))?(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят)(?:ого))|(?:трет(?:ьего))))?(?:[ \n]года|[ \n]г\.)(?:[ \n]до[ \n]нашей[ \n]эры|[ \n]до[ \n]н\.[ \n]?э\.)?)?)|(?:\d+(?:[ \n]год[уа]?|[ \n]г\.)(?:[ \n]до[ \n]нашей[ \n]эры|[ \n]до[ \n]н\.[ \n]?э\.)?))))|(?:(?:(?:(?:(?:(?:(?:(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят|десят)(?:ой|ый|ого|ое|ому|ым|ом))|(?:трет(?:ье(?:му|го|м)?|ий|им)))|(?:(?:одиннадцат|двенадцат|тринадцат|четырнадцат|пятнадцат|шестнадцат|семнадцат|восемнадцат|девятнадцат)(?:и|ь|ью|ого|ому|ый|ым|ом))|[1-2][0-9]|[1-9]|двадцатого|(?:двадцать )(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят)(?:ой|ый|ого|ое|ому|ым|ом))|(?:трет(?:ье(?:му|го|м)?|ий|им)))))(?:[ \n]?(?:(?:январ|феврал|апрел|июн|июл|сентябр|октябр|ноябр|декабр)(?:[ьяею]|[её]м)|(?:март|август)(?:[уеа]|ом)?|ма(?:[яею]|ем)|числ(?:[оау]|ом))))|(?:(?:тридцатого|30)(?:[ \n](?:января|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря|числа)))|(?:(?:тридцать[ \n]первого|31)(?:[ \n](?:января|марта|мая|июля|августа|октября|декабря|числа))))|(?:(?:(?:во?|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| середин[еауы]| конец| начало)?[ \n])(?:[ \n]?(?:(?:январ|феврал|апрел|июн|июл|сентябр|октябр|ноябр|декабр)(?:[ьяею]|[её]м)|(?:март|август)(?:[уеа]|ом)?|ма(?:[яею]|ем)|числ(?:[оау]|ом)))))(?:(?:\x20(?:\d+|прошлого|э?того|следующего|двухтысячного|тысячного|тр[её]хтысячного|(?:две|три|четыре|пять|шесть|семь) тысячи?))?(?:[ \n](?:ст[оа]|двести|двухсот(?:ого)?|триста|тр[её]хсот(?:ого)?|четыреста|четыр[её]хсот(?:ого)?|пят[ьи]сот(?:ого)?|шест[ьи]сот(?:ого)?|сем[ьи]сот(?:ого)?|восемьсот|восьмисот(?:ого)?|девят[ьи]сот(?:ого)?))?(?:[ \n](?:двадцат(?:[ьи]|ого)|тридцат(?:[ьи]|ого)|сорок(?:а|ового)?|пятьдесят|пятидесяти(?:ого)?|шестьдесят|шестидесяти(?:ого)?|семьдесят|семидесяти(?:ого)?|восемьдесят|восьмидесяти(?:ого)?|девяност(?:ого|[оа])))?(?:(?:(?:(?:перв|втор|четв[её]рт|пят|шест|седьм|восьм|девят)(?:ого))|(?:трет(?:ьего))))?(?:[ \n]года|[ \n]г\.)(?:[ \n]до[ \n]нашей[ \n]эры|[ \n]до[ \n]н\.[ \n]?э\.)?)?)|(?:\d+(?:[ \n]год[уа]?|[ \n]г\.)(?:[ \n]до[ \n]нашей[ \n]эры|[ \n]до[ \n]н\.[ \n]?э\.)?)))[ \n]?,?[ \n]?(?:(?:(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)(?:[ \n]утром|[ \n]вечером|[ \n]дн[её]м)?)|(?:(?:(?:сегодня|вчера|завтра|послезавтра|позавчера)[ \n])?(?:утром|вечером|дн[её]м|ночью)))|(?:(?:(?:(?:во?|на|до|с|со|по|в течение|к|об?|за)(?:(?: начал| конц)[ауе]| середин[еауы]| конец| начало)?[ \n])(?:[^ \n]+[ \n])?(?:год[уа]?|месяц[еа]?|век[еу]?|тысячелети[июе]|полугоди[еюи]|квартал[еу]?|половин[еау]?|понедельник[уа]?|вторник[уа]?|сред[уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю]|числа|утр(?:ом?а)|вечер(?:а|ом)?|(?:день|дня|дн[её]м)|недел[еяи]|день|дни|днях|январ[ьея]|феврал[ьея]|март[ае]?|апрел[ьея]|ма[йея]|июн[ьея]|июл[ьея]|август[еа]?|сентябр[ьея]|октябр[ьея]|ноябр[ьея]|декабр[ьея]|зимой|летом|весной|осенью|лето|зима|осень|весна|(?:утром|вечером|дн[её]м|ночью)|выходны[ех]))))|(?:во?|на|до|с|со|по|в течение|к|об?|за)[ \n](?:понедельник[уа]?|вторник[уа]?|сред[уеаы]|четверг[уа]?|пятниц[аыуе]|суббот[аыеу]|воскресень[еяю])))"

DATE_REGEXP = r"(?:(?<=\x20)|(?<=^))(?:" + r"(?:(?:год \d+(?:-ый))|(?:месяц (?:январь|февраль|март|апрель|май|июнь|июль|август|сентябрь|октябрь|ноябрь|декабрь)))"\
              + r"|" + r"(?:" + DATE_S_PO + r")" + r"|" + r"(?:" + DATE_DDMMYY_WITH_UTOCHN + r")"\
              + r"|" + r"(?:" + DATE_PLUS_TEXT + r")" + r"|" + r"(?:" + DATE_CHEREZ_NAZAD + r")" \
              + r"|" + r"(?:" + DATE_PRIL_PLUS_SUSH + r")" + r"|" + r"(?:" + DATE_DDMMYY_S_PREDLOG + r")" + r"|" + r"(?:" \
              + DATE_DATE_TEXT + r")" + r"|" +r"(?:(?:(?:следующи|прошлы|последни|предыдущи|позапрошлы|будущи|грядущи|вчерашни|завтрашни|прошешдши)[йе]|этот|тот|те|эти)[ \n](?:день|дни|месяца?|года?))"\
              + r")(?=(?:\x20|$|[.,!?;\-\(\)\"']))"

DATE_MONTH_YEAR_REGEX = r"(?:(?:январь|февраль|март|апрель|июнь|июль|август|сентябрь|октябрь|ноябрь|декабрь)[ \n][^ " \
                        r"\n.,:!?]+[ \n]года)"


DATE_REGEXP = rf"{DATE_REGEXP}|{DATE_MONTH_YEAR_REGEX}"
EXTRA1_REGEX = r"(?:(?:осенью|весной|летом|зимой)|(?:к (?:весне|лету|зиме|осени)))[ \n]\d+[ \n]года"
EXTRA_REGEX = r"(?:в середине|в начале|в конце|начала|конца|середины|на рубеже|рубежа)(?:(?:[ \n](?:\d+|[XIV]+)[ \n](?:веков|век[аеу]?))|[ \n]\d+-х годов)"
DATE_REGEXP_FULL = rf"(?i)(?m)(?:{DATE_REGEXP})|(?:{EXTRA_REGEX})|(?:{EXTRA1_REGEX})"